app/views/books/index.html.erb

            <td class="p-3">
              コメント数：<%= book.book_comments.count %>
---
SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 3]]